In [54]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [55]:
ser = Series(np.arange(3), index=['A','B','C'])

In [56]:
ser

A    0
B    1
C    2
dtype: int64

In [57]:
ser.drop('B')

A    0
C    2
dtype: int64

In [58]:
dframe1 = DataFrame(np.arange(9).reshape(3,3),['SF','LA','NY'],columns=['POP','SIZE','YEAR'])

In [59]:
dframe1

    POP  SIZE  YEAR
SF    0     1     2
LA    3     4     5
NY    6     7     8

In [60]:
dframe2 = dframe1.drop('LA')

In [61]:
dframe2

    POP  SIZE  YEAR
SF    0     1     2
NY    6     7     8

In [62]:
dframe1

    POP  SIZE  YEAR
SF    0     1     2
LA    3     4     5
NY    6     7     8

In [63]:
dframe1.drop('YEAR',axis=1)

    POP  SIZE
SF    0     1
LA    3     4
NY    6     7